In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import mysql.connector

db=mysql.connector.connect(host = "localhost",
                            username = "root",
                            password = "1234",
                            database = "ecommerce")
cur=db.cursor()

# 1. List all unique cities where customers are located.

In [12]:
query = """ select distinct customer_city  from customers """

cur.execute(query)

data = cur.fetchall()

df = pd.DataFrame(data,columns = ["Customer Location(city)"])
df.head()

       Customer Location
0                 franca
1  sao bernardo do campo
2              sao paulo
3        mogi das cruzes
4               campinas

# 2. Count the number of orders placed in 2017.

In [18]:
query="""select count( order_id) from orders where year(order_purchase_timestamp)=2017"""
cur.execute(query)
data=cur.fetchall()
"total orders placed in 2017 are",data[0][0]

('total orders placed in 2017 are', 90202)

# 3. Find the total sales per category.

In [20]:
query=""" select upper(products.product_category) category,round(sum(payments.payment_value),2) sales from products join order_items on 
         products.product_id=order_items.product_id join payments on payments.order_id=order_items.order_id
         group by category"""
cur.execute(query)
data=cur.fetchall()
df=pd.DataFrame(data,columns=["sales","category"])
df

                          sales    category
0                     PERFUMERY  1013477.32
1          FURNITURE DECORATION  2860352.78
2                     TELEPHONY   973764.10
3                BED TABLE BATH  3425107.34
4                    AUTOMOTIVE  1704588.66
..                          ...         ...
69               CDS MUSIC DVDS     2398.86
70                   LA CUISINE     5827.06
71  FASHION CHILDREN'S CLOTHING     1571.34
72                     PC GAMER     4348.86
73       INSURANCE AND SERVICES      649.02

[74 rows x 2 columns]